app/views/office_categories/_form.html.erb

SELECT "office_categories".* FROM "office_categories" ORDER BY "office_categories"."name" ASC
---
        <%= form.label :office_category_master_id, "Category Name" %>
        <%= form.select :office_category_master_id, options_for_select(@category_master_options, office_category.office_category_master_id), { prompt: "Select category name" } %>