app/views/fcos/_form.html.erb

SELECT "pmus".* FROM "pmus"
---
        <%= f.label :pmu_id, "PMU" %>
        <%= f.select :pmu_id, options_for_select(@pmus.map { |pmu| ["#{pmu.state.name} / #{pmu.location_district.name} / #{pmu.block&.name || '-'} / #{pmu.name}", pmu.id] }, @fco.pmu_id), { prompt: "Select PMU" } %>