app/views/product_varieties/_form.html.erb

SELECT "products".* FROM "products" WHERE "products"."theme_id" = 1
---
          <%= form.label :product_id, "Product" %>
          <%= form.grouped_collection_select :product_id, @themes, :products, :name, :id, :name, { prompt: "Select product" }, class: "form-control" %>