app/views/vendor_registrations/_form.html.erb

    <div class="app-form-grid">
      <div class="app-form-field <%= "has-error" if field_errors.call(:theme_ids).any? %>" data-checkbox-group="true" data-checkbox-group-label="Theme Name">
---
SELECT "themes".* FROM "themes" ORDER BY "themes"."name" ASC


      <div class="app-form-field <%= "has-error" if field_errors.call(:product_ids).any? %>" data-checkbox-group="true" data-checkbox-group-label="Product Name">
---
SELECT "products".* FROM "products" ORDER BY "products"."name" ASC

            <label class="app-checkbox-card vendor-product-card" data-theme-id="<%= product.theme_id %>">
              <%= check_box_tag "vendor_registration[product_ids][]", product.id, vendor_registration.product_ids.include?(product.id), class: "vendor-product-checkbox", data: { theme_id: product.theme_id, product_id: product.id } %>
---
SELECT "products".* FROM "products" WHERE "products"."theme_id" = 1

            <label class="app-checkbox-card vendor-variety-card" data-product-id="<%= product_variety.product_id %>">
              <%= check_box_tag "vendor_registration[product_variety_ids][]", product_variety.id, vendor_registration.product_variety_ids.include?(product_variety.id), class: "vendor-variety-checkbox", data: { product_id: product_variety.product_id } %>
---
SELECT "product_varieties".* FROM "product_varieties" WHERE "product_varieties"."product_id" = 1