app/views/districts/_form.html.erb

<%= f.label :state %>
<%= f.collection_select :state_id, State.all, :id, :name %>
---
SELECT "states".* FROM "states"