app/views/pmus/_form.html.erb

<%= f.label :district %>
<%= f.collection_select :district_id, District.all, :id, :name %>
---
SELECT "districts".* FROM "districts"