app/controllers/allocations_controller.rb

  def index
    @allocations = Allocation.all
---
SELECT "allocations".* FROM "allocations"