app/controllers/approval_channels_controller.rb

SELECT "approval_channels".* FROM "approval_channels" ORDER BY "approval_channels"."form_name" ASC
---
  def index
    @approval_channels = ApprovalChannel.order(:form_name)