app/controllers/blocks_controller.rb

  def index
    @blocks = Block.includes(district: :state).order(:name)
---
SELECT "blocks".* FROM "blocks" ORDER BY "blocks"."name" ASC

    def load_districts
      @districts = District.includes(:state).order(:name)
---
SELECT "districts".* FROM "districts" ORDER BY "districts"."name" ASC
SELECT "states".* FROM "states" WHERE "states"."id" IN (7, 3)