app/controllers/districts_controller.rb

SELECT "districts".* FROM "districts"
---
  def index
    @districts = District.all

SELECT "states".* FROM "states"
---
  def new
    @district = District.new
    @states = State.all

INSERT INTO "districts" ("name", "state_id", "created_at", "updated_at") VALUES ('abc', 2, '2026-03-16 11:11:02.892820', '2026-03-16 11:11:02.892820') RETURNING "id"
---
  def create
    @district = District.new(district_params)

    if @district.save

SELECT "districts".* FROM "districts" WHERE "districts"."id" = 1 LIMIT 1
SELECT "states".* FROM "states"
---
  def edit
    @district = District.find(params[:id])
    @states = State.all

SELECT "districts".* FROM "districts" WHERE "districts"."id" = 1 LIMIT 1
UPDATE "districts" SET "name" = 'shadol', "updated_at" = '2026-03-19 04:16:05.989730' WHERE "districts"."id" = 10
---
  def update
    @district = District.find(params[:id])

    if @district.update(district_params)

SELECT "districts".* FROM "districts" WHERE "districts"."id" = 3 LIMIT 1
DELETE FROM "districts" WHERE "districts"."id" = 2
---
def destroy
  @district = District.find(params[:id])

  if @district.destroy