app/controllers/document_masters_controller.rb

  def index
    @document_masters = DocumentMaster.all
---
SELECT "document_masters".* FROM "document_masters"