app/controllers/fcos_controller.rb

  def index
    @fcos = Fco.all
---
SELECT "fcos".* FROM "fcos"

  def new
    @fco = Fco.new
    @pmus = Pmu.all
---
SELECT "pmus".* FROM "pmus"

  def create
    @fco = Fco.new(fco_params)

    if @fco.save
---
INSERT INTO "fcos" ("name", "pmu_id", "created_at", "updated_at") VALUES ('dfd', 3, '2026-03-16 11:13:25.248144', '2026-03-16 11:13:25.248144') RETURNING "id"

  def edit
    @fco = Fco.find(params[:id])
    @pmus = Pmu.all
---
SELECT "fcos".* FROM "fcos" WHERE "fcos"."id" = 2 LIMIT 1
SELECT "pmus".* FROM "pmus"

 def destroy
  @fco = Fco.find(params[:id])

  if @fco.destroy
---
SELECT "fcos".* FROM "fcos" WHERE "fcos"."id" = 2 LIMIT 1
DELETE FROM "fcos" WHERE "fcos"."id" = 3