app/controllers/office_categories_controller.rb

SELECT "office_categories".* FROM "office_categories" ORDER BY "office_categories"."office_level" ASC, "office_categories"."name" ASC
---
  def index
    @office_categories = OfficeCategory.includes(:parent).order(:office_level, :name)

INSERT INTO "office_categories" ("name", "office_level", "parent_id", "created_at", "updated_at") VALUES ('asa', 'PMU', NULL, '2026-03-19 06:16:03.594438', '2026-03-19 06:16:03.594438') RETURNING "id"
---
  def create
    @office_category = OfficeCategory.new(office_category_params)

    respond_to do |format|
      if @office_category.save

SELECT "office_categories".* FROM "office_categories" WHERE "office_categories"."id" = 1 LIMIT 1
---
    def set_office_category
      @office_category = OfficeCategory.find(params.expect(:id))

SELECT "office_categories".* FROM "office_categories" ORDER BY "office_categories"."name" ASC
---
    def load_parent_categories
      @parent_categories = OfficeCategory.order(:name)