app/controllers/pmus_controller.rb

SELECT "pmus".* FROM "pmus"
---
  def index
    @pmus = Pmu.all

SELECT "districts".* FROM "districts"
---
  def new
    @pmu = Pmu.new
    @districts = District.all

INSERT INTO "pmus" ("name", "district_id", "created_at", "updated_at") VALUES ('', 1, '2026-03-16 11:12:00.315427', '2026-03-16 11:12:00.315427') RETURNING "id"
---
  def create
    @pmu = Pmu.new(pmu_params)

    if @pmu.save

SELECT "pmus".* FROM "pmus" WHERE "pmus"."id" = 6 LIMIT 1
SELECT "districts".* FROM "districts"
---
  def edit
    @pmu = Pmu.find(params[:id])
    @districts = District.all

SELECT "pmus".* FROM "pmus" WHERE "pmus"."id" = 6 LIMIT 1
UPDATE "pmus" SET "name" = 'shahdol', "updated_at" = '2026-03-16 11:23:17.731773' WHERE "pmus"."id" = 6
---
  def update
    @pmu = Pmu.find(params[:id])

    if @pmu.update(pmu_params)

SELECT "pmus".* FROM "pmus" WHERE "pmus"."id" = 4 LIMIT 1
DELETE FROM "pmus" WHERE "pmus"."id" = 1
---
def destroy
  @pmu = Pmu.find(params[:id])

  if @pmu.destroy