app/controllers/product_varieties_controller.rb

SELECT "product_varieties".* FROM "product_varieties" ORDER BY "product_varieties"."name" ASC
---
  def index
    @product_varieties = ProductVariety.includes(product: :theme).order(:name)

SELECT "themes".* FROM "themes" ORDER BY "themes"."name" ASC
---
    def load_themes
      @themes = Theme.includes(:products).order(:name)