app/controllers/products_controller.rb

  def index
    @products = Product.includes(:theme).order(:name)
---
SELECT "products".* FROM "products" ORDER BY "products"."name" ASC

  def new
    @product = Product.new
    @themes = Theme.order(:name)
---
SELECT "themes".* FROM "themes" ORDER BY "themes"."name" ASC

  def create
    @product = Product.new(product_params)

    if @product.save
---
INSERT INTO "products" ("name", "description", "theme_id", "created_at", "updated_at") VALUES ('fan', NULL, 1, '2026-03-17 09:00:47.680736', '2026-03-17 09:00:47.680736') RETURNING "id"