app/controllers/registration_types_controller.rb

  def index
    @registration_types = RegistrationType.all
---
SELECT "registration_types".* FROM "registration_types"