app/controllers/service_types_controller.rb

SELECT "service_types".* FROM "service_types"
---
  def index
    @service_types = ServiceType.all