app/controllers/stakeholder_categories_controller.rb

SELECT "stakeholder_categories".* FROM "stakeholder_categories" WHERE "stakeholder_categories"."name" = 'ASA' ORDER BY "stakeholder_categories"."name" ASC
---
  def index
    @stakeholder_categories = StakeholderCategory.includes(:office_category).order(:name)

INSERT INTO "stakeholder_categories" ("name", "office_category_id", "created_at", "updated_at") VALUES ('ASA', NULL, '2026-03-19 06:42:00.025912', '2026-03-19 06:42:00.025912') RETURNING "id"
---
  def create
    @stakeholder_category = StakeholderCategory.new(stakeholder_category_params)

    respond_to do |format|
      if @stakeholder_category.save

SELECT "office_categories".* FROM "office_categories" ORDER BY "office_categories"."name" ASC
---
    def load_office_categories
      @office_categories = OfficeCategory.order(:name)