app/controllers/states_controller.rb

  def create
    @state = State.new(state_params)

    if @state.save
---
INSERT INTO "states" ("name", "created_at", "updated_at") VALUES ('madhya pradesh', '2026-03-16 08:43:16.551272', '2026-03-16 08:43:16.551272') RETURNING "id"

  def edit
    @state = State.find(params[:id])
---
SELECT "states".* FROM "states" WHERE "states"."id" = 3 LIMIT 1

  def update
    @state = State.find(params[:id])

    if @state.update(state_params)
---
SELECT "states".* FROM "states" WHERE "states"."id" = 3 LIMIT 1
UPDATE "states" SET "name" = 'madhya pradesh', "updated_at" = '2026-03-18 04:27:05.007364' WHERE "states"."id" = 3

def destroy
  @state = State.find(params[:id])

  if @state.destroy
---
SELECT "states".* FROM "states" WHERE "states"."id" = 1 LIMIT 1
DELETE FROM "states" WHERE "states"."id" = 2