app/controllers/themes_controller.rb

SELECT "themes".* FROM "themes"
---
  def index
    @themes = Theme.all

INSERT INTO "themes" ("name", "created_at", "updated_at") VALUES ('electric', '2026-03-17 08:18:24.988158', '2026-03-17 08:18:24.988158') RETURNING "id"
---
  def create
    @theme = Theme.new(theme_params)

    if @theme.save

SELECT "themes".* FROM "themes" WHERE "themes"."id" = 2 LIMIT 1
DELETE FROM "themes" WHERE "themes"."id" = 2
---
    def destroy
    @theme = Theme.find(params[:id])
    @theme.destroy