app/controllers/tos_controller.rb

SELECT "fcos".* FROM "fcos"
---
  def new
    @to = To.new
    @fcos = Fco.all

SELECT "fcos".* FROM "fcos"
---
  def edit
    @to = To.find(params[:id])
    @fcos = Fco.all