app/controllers/units_controller.rb

  def index
    @units = Unit.all
---
SELECT "units".* FROM "units"

  def create
    @unit = Unit.new(unit_params)

    respond_to do |format|
      if @unit.save
---
INSERT INTO "units" ("name", "created_at", "updated_at") VALUES ('1', '2026-03-19 06:48:42.216540', '2026-03-19 06:48:42.216540') RETURNING "id"

    def set_unit
      @unit = Unit.find(params.expect(:id))
---
SELECT "units".* FROM "units" WHERE "units"."id" = 1 LIMIT 1