app/controllers/vendor_bank_masters_controller.rb

SELECT "vendor_bank_masters".* FROM "vendor_bank_masters" ORDER BY "vendor_bank_masters"."created_at" DESC
---
  def index
    @vendor_bank_masters = VendorBankMaster.includes(:vendor_registration).order(created_at: :desc)

SELECT "vendor_registrations".* FROM "vendor_registrations" ORDER BY "vendor_registrations"."vendor_name" ASC
---
    def load_vendor_registrations
      @vendor_registrations = VendorRegistration.order(:vendor_name)