app/controllers/vendor_registrations_controller.rb

  def index
    sync_vendor_approval_requests!

    base_scope = VendorRegistration.includes(
      :stakeholder_category,
      :registration_type,
      :firm,
      :state,
      :district,
      :block,
      approval_request: :approval_steps
    )
---
SELECT "vendor_registrations".* FROM "vendor_registrations" ORDER BY "vendor_registrations"."created_at" DESC

    def load_form_collections
      @stakeholder_categories =
        if admin_user? || @current_stakeholder_category.blank?
          StakeholderCategory.order(:name)
        else
          StakeholderCategory.where(id: @current_stakeholder_category.id)
        end
      @registration_types = RegistrationType.order(:name)
      @firms = Firm.order(:name)
      @document_masters = DocumentMaster.includes(:firm).order(:name)
      @states = State.order(:name)
      @districts = District.includes(:state).order(:name)
      @blocks = Block.includes(district: :state).order(:name)
      @district_filter_data = @districts.map do |district|
        { id: district.id, name: district.name, state_id: district.state_id }
      end
      @block_filter_data = @blocks.map do |block|
        { id: block.id, name: block.name, district_id: block.district_id, state_id: block.district&.state_id }
      end
      @themes = Theme.includes(products: :product_varieties).order(:name)
      @products = Product.includes(:theme).order(:name)
---
SELECT "registration_types".* FROM "registration_types" ORDER BY "registration_types"."name" ASC
SELECT "firms".* FROM "firms" ORDER BY "firms"."name" ASC
SELECT "states".* FROM "states" ORDER BY "states"."name" ASC
SELECT "districts".* FROM "districts" ORDER BY "districts"."name" ASC
SELECT "states".* FROM "states" WHERE "states"."id" IN (7, 3)
SELECT "blocks".* FROM "blocks" ORDER BY "blocks"."name" ASC
SELECT "product_varieties".* FROM "product_varieties" ORDER BY "product_varieties"."name" ASC
SELECT "themes".* FROM "themes" ORDER BY "themes"."name" ASC
SELECT "products".* FROM "products" ORDER BY "products"."name" ASC