app/views/products/_form.html.erb

    <%= f.label :theme_id, "Thematic Type", class: "form-label" %>
    <%= f.collection_select :theme_id, Theme.order(:name), :id, :name, { prompt: "Select thematic type" }, class: "form-control" %>
---
SELECT "themes".* FROM "themes" ORDER BY "themes"."name" ASC