app/views/products/_form.html.erb

  <% batch_stakeholder_id = batch_context[:stakeholder_category_id].presence || current_employee_master&.stakeholder_category_id %>
  <% batch_theme_id = batch_context[:theme_id].presence || product_rows.find { |row| row.theme_id.present? }&.theme_id %>
---
SELECT "themes".* FROM "themes"