app/views/tos/_form.html.erb

        <%= f.label :fco_id, "FCO" %>
        <%= f.select :fco_id, options_for_select(@fcos.map { |fco| ["#{fco.state.name} / #{fco.district.name} / #{fco.block&.name || '-'} / #{fco.pmu.name} / #{fco.name}", fco.id] }, @to.fco_id), { prompt: "Select FCO" } %>
---
SELECT "fcos".* FROM "fcos"